/*******************************************************************************
*  Melody - 圧電スピーカからメロディを鳴らします                               *
*                                                                              *
* ============================================================================ *
*  VERSION DATE        BY                    CHANGE/COMMENT                    *
* ---------------------------------------------------------------------------- *
*  1.00    2011-02-24  きむ茶工房(きむしげ)  Create                            *
*******************************************************************************/

#define BEAT 300          // 音の長さを指定
#define PINNO 12          // 圧電スピーカを接続したピン番号

/*******************************************************************************
*  電源起動時とリセットの時だけのみ処理される関数(初期化と設定処理)            *
*******************************************************************************/
void setup() {
     pinMode(12,OUTPUT) ; // 圧電スピーカを接続したピンをデジタル出力で指定
}
/*******************************************************************************
*  繰り返し実行される処理の関数(メインの処理)                                  *
*******************************************************************************/
void loop() {
     melody(262,BEAT) ;   // ド
     melody(294,BEAT) ;   // レ
     melody(330,BEAT) ;   // ミ
     melody(349,BEAT) ;   // ファ
     melody(392,BEAT) ;   // ソ
     melody(440,BEAT) ;   // ラ
     melody(494,BEAT) ;   // シ
     melody(523,BEAT) ;   // ド
     delay(3000) ;
}
/*******************************************************************************
*  melody(frequency,duration)                                                  *
*    メロディを実際に鳴らす処理の関数                                          *
*    １サイクルのパルスを作成して、それを音の長さだけ繰り返し出力しています。  *
*    "i += tones * 2"がテンポです、２を１とかするとテンポが変わります。        *
*                                                                              *
*    frequency:周波数(Hz)値で音の高さを指定する数値です                        *
*    duration :音の長さを指定する数値です                                      *
*******************************************************************************/
void melody(int frequency, int duration)
{
     long i ;
     int  tones ;

     // 指定された周波数から１サイクルの長さを計算する
     tones = 1000000L / (2 * frequency) ;
     // 同じ長さのパルス(１サイクル)を繰返す
     for (i = 0; i < duration * 1000L; i += tones * 2) {
          digitalWrite(PINNO, HIGH) ;
          delayMicroseconds(tones) ;
          digitalWrite(PINNO, LOW) ;
          delayMicroseconds(tones) ;
     }
}
